// Задача 18: Напишите программу, которая по заданному номеру четверти,
// показывает диапазон возможных координат точек в этой четверти (x и y).

Console.WriteLine ("Ввердите номер четверти:");
int N=Convert.ToInt32(Console.ReadLine());